refactor: readme + palette colori + fix deprecati
